# BSON类型

BSON是mongoDB中一个二进制序列化标准使用来存储文档和远程方法调用。BSON规范位于bsonspec.org。

每个BSON类型都有先一个整数和字符身份作为列表在下面表格：
<table>
<tr><th>Type</th><th>Number</th><th>Alias</th><th>Notes</th></tr> 
<tr><td>Double</td><td> 1</td><td> "double"</td><td></td> </tr>
<tr><td>String</td><td> 2</td><td> "string" </td><td></td> </tr>
<tr><td>Object</td><td>3</td><td>"object"</td><td></td></tr>
<tr><td>Array</td> <td>4</td><td> "array" </td><td></td></tr>
<tr><td>Binary data</td><td>5</td><td>"binData"</td><td></td></tr>
<tr><td>Undefined</td><td>6</td><td>"undefined"</td><td>Deprecated</td></tr>
<tr><td>ObjectId</td><td>7</td><td>"objectId"</td><td></td></tr> 
<tr><td>Boolean</td><td>8</td><td>"bool"</td><td></td></tr>
<tr><td>Date</td><td>9</td><td>"date"</td><td></td></tr>
<tr><td>Null</td><td>10</td><td>"null"</td><td></td></tr>
<tr><td>Regular Expression</td><td>11</td><td> "regex"</td><td></td></tr>
<tr><td>DBPointer</td><td>12 </td><td> "dbPointer" </td><td>已删除。</td></tr>
<tr><td>JavaScript</td><td>13</td><td>"javascript"</td><td></td></tr>
<tr><td>Symbol</td><td>14</td><td>"symbol"</td><td>已删除</td></tr>
<tr><td>JavaScript (with scope)</td><td>15</td><td>"javascriptWithScope"</td><td></td></tr>
<tr><td>32-bit integer</td><td>16</td><td>"int"</td><td></td></tr>
<tr><td>Timestamp</td><td>17</td><td>"timestamp"</td><td></td></tr>
<tr><td>64-bit integer</td><td>18</td><td>"long"</td><td></td></tr>
<tr><td>Decimal128</td><td>19</td><td>"decimal"</td><td>version3.4新增</td></tr>
<tr><td>Min key</td><td>-1</td><td>"minkey"</td><td></td></tr>
<tr><td>Max key </td><td>127</td><td>"maxkey"</td><td></td></tr>

</table>
您可以使用$type操作符来使用这些值，以通过BSON类型查询文档。$类型聚合操作符使用列出的BSON类型字符串之一返回操作符表达式的类型。

## ObjectId

ObjectId很小，唯一的，并且快速生成而有序的。ObjectId值由12位组成，前4位是一个时间戳代表ObjectId创建，特别地:

- 一个4-byte值代表自Unix出身以来的秒数。
- 一个3-byte匹配机器身份。
- 一个2-byte处理id，和
- 一个3-byte计时器，从一个随机数开始。

在MongoDB里，所有文档存储在一个集合需要一个唯一的\_id属性作为一个主键。如果一个插入的文档没有\_id属性，MongoDB驱动自动地生成一个ObjectId的\_id属性。

这也同样适用于设置了upsert:true的插入操作来插入文档。

MongoDB客户端需要添加一个为一个ObjectId的\_id属性。对\_id属性使用ObjectId有一下好处:

- 在 mongo shell，你可以从ObjectId中获取创建时间，使用```ObjectId.getTimestamp()```方法。
- 对存储ObjectId值的_id字段进行排序，大致相当于按创建时间排序。

> 重要：ObjectId值的排序和生成时间在同一时间并不严格。如果多系统，或者多处理器或县城在同一时间生成值。ObjectId值不能提供一个严格的插入时间。客户端之间的时钟偏差也会导致对值的不严格排序，因为客户端驱动程序生成了ObjectId值。

## String 

BSON字符串是UTF-8.通常，每个变成语言的驱动转化语言字符标准为UTF-8当序列化和反序列化BSON。这使得可以轻松地在BSON字符串中存储大多数国际字符。此外，MongoDB$regex查询支持UTF-8在正则字符。

>给定字符串使用UTF-8字符集，在字符串上使用sort()将是相当正确的。但是，由于内部sort()使用c++ strcmp api，排序顺序可能会错误地处理某些字符

## 时间戳

BSON有一个特别的时间戳类型提供MongoDB内部使用并且不与常规日期类型相关联。时间戳值为64位值:
- 前32位是一个time_t值(自linux以来的秒)
- 后32位是在给定的秒内进行操作的递增序数。

在一个单mongod 实例，时间戳的值永远唯一。

在复制中，oplog有一个ts字段。该字段中的值反映操作时间，使用BSON时间戳值。

> 注意: BSON时间戳类型是内部MongoDB使用。

如果你插入一个文档包含一个空的BSON时间错在高等级属性中，MongoDB服务器会替代为一个当前时间戳的值。例如，如果你创建一个文档插入一个时间戳值:

<pre>
> db.test.insertOne({ts: a})
{
        "acknowledged" : true,
        "insertedId" : ObjectId("5a5da5e862f4a9f18064269d")
}
> db.test.find()
{ "_id" : ObjectId("5a5da5bc62f4a9f18064269c"), "ts" : Timestamp(1516086716, 1) }
{ "_id" : ObjectId("5a5da5e862f4a9f18064269d"), "ts" : Timestamp(1516086760, 1) }
</pre>

如果是一个嵌套文档，那么不会这么干：
<pre>
> db.test.insertOne({ts:{ts:a}})
{
        "acknowledged" : true,
        "insertedId" : ObjectId("5a5da6d162f4a9f18064269e")
}
> db.test.find()
{ "_id" : ObjectId("5a5da5bc62f4a9f18064269c"), "ts" : Timestamp(1516086716, 1) }
{ "_id" : ObjectId("5a5da5e862f4a9f18064269d"), "ts" : Timestamp(1516086760, 1) }
{ "_id" : ObjectId("5a5da6d162f4a9f18064269e"), "ts" : { "ts" : Timestamp(0, 0) } }
> 
</pre>

在2.6版本中更改:以前，服务器只会在前两个字段中替换空的时间戳值，包括插入文档的_id。现在MongoDB将替换任何顶级字段。

## Date

BSON Date是一个64位的整数代表毫秒数字从Unix(Jan 1,1970)。

这导致了一个可描绘的日期范围，大约2.9亿年前，进入过去和未来。

官方BSON规范将BSON日期类型定义为UTC datetime。

BSON日期类型签名。负值表示1970年以前的日期。

<pre>
例如:
构造一个日期使用 new Date()构造器在mongo shell:

var mydate1 = new Date()

</pre>

<pre>

EXAMPLE:

构造一个日期使用 ISODate()构造器在mongo shell:

var mydate2 = ISODate()

</pre>

<pre>
> mydate1.toString()
Tue Jan 16 2018 07:30:51 GMT+0000 (UTC)
> mydate2.toString()
Tue Jan 16 2018 07:32:26 GMT+0000 (UTC)
> mydate1.getMonth()
0
> mydate1.getDay()
2
> mydate1.getYear()
118
</pre>
